Repository: mellterm/termbase
Catalog: public/system/documents/data/000/000/005/original/business_1.tmx
Source language: de_de
Languages: en_gb

source: Klare Sicht auf alle Daten
en_gb: A clear view of all data

source: Übersichtliche Aufstellungen und Analysen aller wichtigen Daten der Lieferkette – das sind nur einige Vorteile des neuen Supply Chain Intelligence (SCI) Dashboards, das derzeit in der gesamten BASF eingeführt wird.
en_gb: Easy-to-read lists and analyses of all important data in the supply chain - this is just a few of the advantages of the new Supply Chain Intelligence (SCI) Dashboard currently being implemented throughout BASF.

source: Das SCI Dashboard ist ein Online-Management-Cockpit für die Datenanalyse, das Controlling, das Reporting und das Monitoring aller Supply-Chain-Aktivitäten der BASF.
en_gb: The SCI Dashboard is an online management cockpit for data analysis, controlling, reporting and monitoring of all supply chain activities at BASF.

source: Mit dem umfangreichen Tool lassen sich für viele Leistungskennzahlen umfangreiche Übersichten schnell und einfach darstellen.
en_gb: The tool allows users to quickly and easily show comprehensive overview screens for many key performance indicators.

source: Kosten, Service und Bestände – anhand dieser drei Aspekte lässt sich die Leistung der Supply Chain (SC). messen.
en_gb: Costs, service and inventories- these three aspects are the means with which the measure the performance of a supply chain (SC) can be measured.

source: Für jeden dieser Bereiche gibt es Kennzahlen (KPIs), für Service zum Beispiel die Lieferzuverlässigkeit.
en_gb: Each of these has a Key Performance Indicator (KPI). For instance, for service, it is delivery reliability.

source: Das SCI Dashboard ermittelt diese Kennzahlen, indem es Daten aus verschiedenen Reporting-Systemen ausliest, die dann gebündelt, konsolidiert und aktuell bereitgestellt werden.
en_gb: The SCI Dashboard calculates these KPIs by taking data from various reporting systems which it then bundles, consolidates, and outputs the latest data.

source: „So müssen Supply Chain Controller, Supply Chain Manager und Business-Analysten die Daten nicht selbst zusammentragen und analysieren, sondern können sich darauf konzentrieren, die Kennzahlen zu interpretieren und angemessene Maßnahmen einzuleiten“, sagt Nicole Mayer, Global Application Owner SCI Dashboard.
en_gb: "This means supply chain controllers, supply chain managers and business analysts do not need to collate and analyse the data themselves but can instead concentrate on interpreting these KPIs and in taking appropriate action", says Nicole Mayer, Global Application Owner SCI Dashboard.

source: „Das spart im Alltag eine Menge Zeit.“
en_gb: "This saves a huge amount of time in day-to-day work".

source: Informationen nach Bedarf
en_gb: Information when its needed

source: Angewendet wird das SCI Dashboard hauptsächlich von Managern aller Hierarchie-Ebenen und SCM Mitarbeitern der operativen Ebene.
en_gb: The SCI Dashboard is mostly used by managers from all hierarchy levels, and SCM staff in Operations.

source: Das Besondere dabei ist, dass jede Geschäftseinheit die Auswertungen und Ansichten an ihren individuellen Bedarf anpassen kann.
en_gb: The special feature of the dashboard is that all business units can customise the evaluations and reviews to its particular need.

source: Wie das aussieht?
en_gb: How does this look?

source: Zum Beispiel lässt sich in einem indizierten Graphen die Entwicklung von wichtigen Kennzahlen wie Liefertreue oder Logistikkosten über längere Zeiträume hinweg global aggregiert darstellen und vergleichen.
en_gb: For example, an indexed graph can show how important KPIs, such as supplier or logistics costs, have changed over a longer period of time- globally, in aggregated form. These can then be compared.

source: So können Manager Trends erkennen und bei Bedarf steuernd eingreifen.
en_gb: Managers can spot trends and take action where necessary.

source: Für Mitarbeiter der operativen Ebene gibt es detaillierte Ansichten und Funktionen.
en_gb: Operative staff have detailed views and functions at their disposal.

source: Die Ansichten sowie die Kalkulationsbasis der KPIs lassen sich außerdem an die Maßgaben einzelner Business Units anpassen.
en_gb: The views and formulas for the KPIs can also be adjusted to the requirements of individual business units.

source: „‚Lieferzuverlässigkeit‘ kann zum Beispiel für zwei Geschäftseinheiten unterschiedlich kalkuliert werden“, erklärt Mayer.
en_gb: "'Delivery reliability', for example can be calculated differently for two business units", explains Mayer.

source: „Während es in der einen Einheit keine Spielräume zulässig sind und die Ware genau am festgelegten Termin zugestellt werden muss, ist für eine andere Einheit dieses Kriterium auch dann erfüllt, wenn die Lieferung einen Tag vor oder nach dem vereinbarten Termin eingeht.
en_gb: "One business unit may not allow any leeway- the goods have to be delivered on precisely the day scheduled, in the other, the criterion can still be met if the delivery is made on a day before or after the agreed date.

source: Welche Toleranzen oder Filterkriterien in eine Kennzahl einfließen, hängt also immer auch vom jeweiligen Geschäft ab.“ Die Anwender können solche individuellen Maßstäbe in das Dashboard eingeben und in der KPI-Ermittlung für ihre Einheiten berücksichtigen.
en_gb: "The line of business will determine which tolerances or filter criteria are applied to a KPU." Users can enter such custom parameters in the dashboard which are then used when calculating the KPI for their units.

source: Zusätzlich können sie auch jederzeit die globalen Standardmaßstäbe im SCI Dashboard verwenden.
en_gb: They can also use the standard global formulas in the SCI Dashboard at any time.

source: Es ist zudem möglich, direkt im Dashboard Ziele für alle KPIs festzulegen, die eine Business Unit als zielrelevant definiert hat, und deren Umsetzung zu überwachen.
en_gb: It is also possible to define targets for all KPIs a business unit has specified as target-relevant, i.e. whose implementation is monitored.

source: Die Ziele werden dafür in einer Monitoring-Ansicht aufgeführt, Ampelfarben zeigen den Status an.
en_gb: The targets are listed in a Monitoring overview screen. Traffic lights are used to show their current status.

source: Beispielsweise lässt sich so feststellen, ob eine vorgegebene Lagerreichweite – also die Anzahl der Tage, für die der Bestand bei einem durchschnittlichen oder geplanten Verbrauch ausreichen soll – eingehalten wird oder nicht.
en_gb: For instance, the system whether a pre-defined inventory coverage figure - the number of days for which the inventory is supposed to be sufficient at average or planned levels of consumption - was met or not.

source: Auch das Reporting wird mit dem SCI Dashboard einfacher:
en_gb: The SCI Dashboard also makes reporting easier:

source: Die KPI-Ansichten lassen sich an den jeweiligen Reporting-Bedarf einer Business Unit oder Funktion anpassen.
en_gb: KPI views can be adapted to a particular need of a business unit or function.

source: „Diese Ansichten können die Anwender als Favoriten im SCI Dashboard hinterlegen“, sagt Mayer.
en_gb: "Users can save these views in the SCI Dashboard as favourites",says Mayer.

source: Weitere Funktionen sind geplant
en_gb: More functions are planned

source: Das SCI Dashboard wird schrittweise um weitere Funktionen ergänzt.
en_gb: New functions will be added to the SCI Dashboard step by step.

source: Beispielsweise wird derzeit eine Planungsperspektive entwickelt, mit der die Supply-Chain-Mitarbeiter den geplanten und tatsächlichen Kundenbedarf für bestimmte Produkte gegeneinander abgleichen können.
en_gb: For example, a planning perspective is currently being developed to allow supply chain employees to compare the planned and actual customer demand for specific products.

source: Dadurch lassen sich Abweichungen frühzeitig erkennen und die Produktion sowie Lieferprozesse entsprechend anpassen.
en_gb: Anomalies can be identified early on and production and delivery processes can be adapted as appropriate.

source: Ziel ist es, eine lückenlose Analyse der Supply-Chain-Prozesse zu ermöglichen.
en_gb: The aim is to provide continuous analysis of supply chain processes.

source: SCI bezeichnet ein Konzept für die Entwicklung einer einzigen, globalen Reporting-Landschaft für das Controlling und Monitoring der gesamten Supply Chain.
en_gb: SCI is a concept for developing a single, global reporting environment for controlling and monitoring the entire supply chain.

source: SCI-Anwendungen stellen sämtliche Informationen zu Logistikprozessen bereit und gewährleisten konsistente und valide Daten auf allen Ebenen des Unternehmens – von Details des operativen Geschäfts im SCI Reporting System bis hin zu einer aggregierten Gesamtübersicht über die BASF Gruppe im SCI Dashboard.
en_gb: SCI applications provide all information about logistics processes and ensure consistent, valid data at all levels of the company - from details of the operative business in the SCI Reporting system to an aggregated overall view of the BASF group in the SCI Dashboard.

source: Auf diese Weise können Business Units und Zentralabteilungen aussagekräftige Informationen wie Key Performance Indicators (KPIs) jederzeit im Blick behalten und diese bis ins Detail analysieren.
en_gb: This allows business units and central departments to keep an eye on significant information such as Key Performance Indicators at all times, as well as analysing such data in detail.

source: Das SCI Dashboard ist ein webbasiertes Management-Cockpit, über das die Anwender auf die SC-Kennzahlen zugreifen können.
en_gb: The SCI Dashboard is a web-based management cockpit that allows users to acccess SC KPIs.
